AUTO_config_TK_pesok/src/Documents/КорректировкаЗаказаПокупателя/КорректировкаЗаказаПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаЗаказаПокупателя</name>
  <comment>Корректировка заказа покупателя</comment>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.РезервыТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПокупателей</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
</mdclass:Document>

AUTO_config_TK_pesok/src/AccumulationRegisters/ЗаказыПокупателей/ЗаказыПокупателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗаказыПокупателей</name>
  <comment>Заказы покупателей</comment>
  <resources>
    <name>Заказано</name>
    <comment>Количество номенклатуры по заказу</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаУпр</name>
    <comment>Сумма заказанной номенклатуры в валюте управленческого учета</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заказ</name>
    <comment>Документ оформления заказа</comment>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура заказа</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <comment>Контрагент, разместивший заказ</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СкладКомпании</name>
    <comment>Склад компании на котором был зарезервирован товар для этого заказа</comment>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/AccumulationRegisters/РезервыТоваров/РезервыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РезервыТоваров</name>
  <resources>
    <name>Резерв</name>
    <comment>Количество зарезервированного товара на складе</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозОперация</name>
    <comment>Хозяйственная операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <comment>Склад компании</comment>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <comment>Характеристика номенклатуры</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <comment>Документ оформления Резерва</comment>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_ОчередьНаСборкуРезервов/ТК_ОчередьНаСборкуРезервов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_ОчередьНаСборкуРезервов</name>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ПриоритетыСборки</types>
    </type>
  </resources>
  <resources>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСборкиРезервов</types>
    </type>
  </resources>
  <resources>
    <name>НачалоСборки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КонецСборки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СотрудникКонтроля</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>НачалоКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КонецКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Упаковщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>ДопСборщик</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РезервированиеЗаказовПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_СостояниеДокументов/ТК_СостояниеДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_СостояниеДокументов</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыСборкиРезервов</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <dimensions>
    <name>СсылкаНаОбъект</name>
    <type>
      <types>DefinedType.ОбъектыСоСтатусами</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Enums/СтатусыСборкиРезервов/СтатусыСборкиРезервов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыСборкиРезервов</name>
  <enumValues>
    <name>ГотовКСборке</name>
  </enumValues>
  <enumValues>
    <name>ВСборке</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
    <comment>Статус для документов собранных и сформированы документы</comment>
  </enumValues>
  <enumValues>
    <name>Доставляется</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>НеНачат</name>
  </enumValues>
  <enumValues>
    <name>Проведен</name>
  </enumValues>
  <enumValues>
    <name>Рекламация</name>
    <comment>статус для акта</comment>
  </enumValues>
  <enumValues>
    <name>СогласованоРЦ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоРЦ</name>
  </enumValues>
  <enumValues>
    <name>СогласованоСБ</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненоСБ</name>
  </enumValues>
  <enumValues>
    <name>Просрочен</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Documents/РезервированиеЗаказовПокупателя/РезервированиеЗаказовПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РезервированиеЗаказовПокупателя</name>
  <comment>Резервирование заказов покупателя</comment>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.РезервыТоваров</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Поставщик/комитент от которого мы получили товар</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорВзаиморасчетов</name>
    <comment>Договор по которому ведутся взаиморасчеты с контрагентом</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаДоставки</name>
    <comment>Адрес доставки для использования в печатных формах (оставлен для совместимости)</comment>
    <type>
      <types>CatalogRef.ТочкиДоставки</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>Резервируемые товары</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар,услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>Единица измерения номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество единиц измерения номенклатуры</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоРазмещения</name>
      <comment>Склад компании, на котором резервируется номенклатура по заказу покупателя.</comment>
      <type>
        <types>CatalogRef.СкладыКомпании</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <comment>Резервируемый заказ покупателя</comment>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеОтгрузки</name>
    <comment>Распределение отгрузки по заказам покупателей</comment>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Documents/КорректировкаЗаказаПокупателя/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ТипДанныхЗаполнения = Тип("ДокументСсылка.ЗаказПокупателя") Тогда 
		ЗаполнитьДокументНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	Иначе
		ИнициализироватьДокумент(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Дата = ТекущаяДата();
	ДокументОснование = Неопределено;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	ДополнительныеСвойства.Вставить("ЭтоНовый"		, ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи"	, РежимЗаписи);
	
	/////Не регистрировать для выгрузки голобал центр
	//Если НЕ ТорговаяПлощадка.РегистрироватьТК Тогда
	//	ДополнительныеСвойства.Вставить("ОбменТК");
	//КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И НЕ ЭтоНовый() И Проведен И НЕ Отказ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Дата КАК Дата
		|ИЗ
		|	Документ.КорректировкаЗаказаПокупателя КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Результат = Запрос.Выполнить();
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ДополнительныеСвойства.Вставить("СтараяДатаДокумента", Выборка.Дата);
		
	Иначе
		ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Ложь);		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Не Отказ Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказПокупателя.Проведен КАК Проведен,
		|	ЗаказПокупателя.ПометкаУдаления КАК ПометкаУдаления
		|ИЗ
		|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|ГДЕ
		|	ЗаказПокупателя.Ссылка = &Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
		|	ЗаказыПокупателейОстатки.ЗаказаноОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ЗаказыПокупателей.Остатки(&НаДату, Заказ = &Заказ) КАК ЗаказыПокупателейОстатки
		|ГДЕ
		|	ЗаказыПокупателейОстатки.ЗаказаноОстаток > 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РезервыТоваровОстатки.Номенклатура,
		|	РезервыТоваровОстатки.РезервОстаток
		|ИЗ
		|	РегистрНакопления.РезервыТоваров.Остатки(&НаДату, Заказ = &Заказ) КАК РезервыТоваровОстатки
		|ГДЕ
		|	РезервыТоваровОстатки.РезервОстаток > 0";
		
		ДатаЗапроса = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "СтараяДатаДокумента", Дата);
		
		Запрос.УстановитьПараметр("НаДату", Новый Граница(ДатаЗапроса, ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("Заказ", ДокументОснование);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		РеквизитыЗаказа = МассивРезультатов[0].Выбрать();		
		Результат = МассивРезультатов[1];
		
		Если РеквизитыЗаказа.Следующий() Тогда
			Если РеквизитыЗаказа.ПометкаУдаления Тогда
				ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Заказ ""%1"" помечен на удаление'; uk = 'Замовлення ""%1"" помічено на видалення'"),
				ДокументОснование),
				Ссылка,,,
				Отказ);
				
			ИначеЕсли Не РеквизитыЗаказа.Проведен Тогда
				ОбщегоНазначения.СообщитьПользователю(
				СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Заказ ""%1"" не проведен'; uk = 'Замовлення ""%1"" не проведене'"),
				ДокументОснование),
				Ссылка,,,
				Отказ);			
			КонецЕсли;
		Иначе
			ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'По заказу ""%1"" не удалось получить данные'; uk = 'По замовленню ""%1"" не вдалося отримати дані'"),
			ДокументОснование),
			Ссылка,,,
			Отказ);
		КонецЕсли;
		
		Если Результат.Пустой() И Не Отказ Тогда 
			ОбщегоНазначения.СообщитьПользователю(
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Заказ ""%1"" помечен на удаление'; uk = 'Замовлення ""%1"" помічено на видалення'"),
			ДокументОснование),
			Ссылка,,,
			Отказ);
		КонецЕсли;
		
		Если Не Отказ Тогда 
			ДополнительныеСвойства.Вставить("ЗаказПокупателя", ДокументОснование);
		КонецЕсли;
	КонецЕсли;		
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("ДатаДокументаСдвинутаВперед") Тогда    
		ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Дата > ДополнительныеСвойства.СтараяДатаДокумента);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);		
	Документы.КорректировкаЗаказаПокупателя.ИнициализироватьДанныеДокумента(Ссылка,ДополнительныеСвойства);	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ЗаказыСервер.ОтразитьЗаказыПокупателей(ДополнительныеСвойства, Движения, Отказ);
	ЗаказыСервер.ОтразитьРезервыТоваров(ДополнительныеСвойства, Движения, Отказ);
	
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	УстановитьСтатусОчереди(ЭтотОбъект, ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЗаказПросрочен", Ложь));
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	//Если ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ЗаказПокупателяВнутренний") Тогда 
	//	МассивНепроверяемыхРеквизитов.Добавить("Товары.Цена");
	//	МассивНепроверяемыхРеквизитов.Добавить("Товары.ЦенаБезНалогов");
	//КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	Если ОбщегоНазначенияТК.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект,  ПроверяемыеРеквизиты) Тогда
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры


#КонецОбласти


#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	
	Дата				  = ТекущаяДата();
	Автор 				  = Пользователи.ТекущийПользователь();
	Организация           = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнаяОрганизация",,Организация);	
	ПодразделениеКомпании = ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
	ТорговаяПлощадка      = ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнаяТорговаяПлощадка",,ТорговаяПлощадка);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;	
	
КонецПроцедуры	

Процедура ЗаполнитьДокументНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Дата = ТекущаяДата();
	Автор = Пользователи.ТекущийПользователь();
	ТипЦен = Справочники.ТипыЦен.ОсновнойТипЦенПродажи;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказПокупателя.Организация КАК Организация,
	|	ЗаказПокупателя.ПодразделениеКомпании КАК ПодразделениеКомпании,
	|	ЗаказПокупателя.ТорговаяПлощадка КАК ТорговаяПлощадка,
	|	ЗаказПокупателя.Ссылка КАК ДокументОснование
	|ИЗ
	|	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	|ГДЕ
	|	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ЗапросНайтиПодчиненныйПоТипу(Знач ДокСсылка,Знач ТипДокумента)
	
	Запрос = Новый Запрос;
	Запрос.Текст =     "ВЫБРАТЬ
	|	СвязанныеДокументы.Ссылка КАК ДокСсылка,
	|	ВЫБОР
	|		КОГДА СвязанныеДокументы.Ссылка ССЫЛКА Документ."+ТипДокумента+"
	|			ТОГДА ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ."+ТипДокумента+").ПометкаУдаления
	|	КОНЕЦ КАК ПометкаУдаления,
	|	ВЫБОР
	|		КОГДА СвязанныеДокументы.Ссылка ССЫЛКА Документ."+ТипДокумента+"
	|			ТОГДА ВЫРАЗИТЬ(СвязанныеДокументы.Ссылка КАК Документ."+ТипДокумента+").Проведен
	|	КОНЕЦ КАК Проведен
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Док) КАК СвязанныеДокументы
	|ГДЕ
	|	СвязанныеДокументы.Ссылка ССЫЛКА Документ."+ТипДокумента+"";
	Запрос.УстановитьПараметр("Док",ДокСсылка);
	
	Возврат Запрос;
	
КонецФункции	

Процедура УстановитьСтатусОчереди(ДокСсылка,ЗаказПросрочен)
	
	Если ЗаказПросрочен = Истина Тогда
		Статус = Перечисления.СтатусыСборкиРезервов.Просрочен;
	Иначе
		Статус = Перечисления.СтатусыСборкиРезервов.Отменен;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РезервированиеЗаказовПокупателя.Ссылка КАК Резерв,
	|	РезервированиеЗаказовПокупателя.ДокументОснование КАК ЗаказПокупателя
	|ПОМЕСТИТЬ Вт
	|ИЗ
	|	Документ.РезервированиеЗаказовПокупателя КАК РезервированиеЗаказовПокупателя
	|ГДЕ
	|	РезервированиеЗаказовПокупателя.ДокументОснование = &ДокСсылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РезервированиеЗаказовПокупателяРаспределениеОтгрузки.Ссылка,
	|	РезервированиеЗаказовПокупателяРаспределениеОтгрузки.ЗаказПокупателя
	|ИЗ
	|	Документ.РезервированиеЗаказовПокупателя.РаспределениеОтгрузки КАК РезервированиеЗаказовПокупателяРаспределениеОтгрузки
	|ГДЕ
	|	РезервированиеЗаказовПокупателяРаспределениеОтгрузки.ЗаказПокупателя.Ссылка = &ДокСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Вт.Резерв КАК Резерв,
	|	Вт.Резерв.ТорговаяПлощадка КАК ТорговаяПлощадка
	|ИЗ
	|	Вт КАК Вт
	|
	|СГРУППИРОВАТЬ ПО
	|	Вт.Резерв,
	|	Вт.Резерв.ТорговаяПлощадка";
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка.ДокументОснование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		ЗаписьВОчереди = РегистрыСведений.ТК_ОчередьНаСборкуРезервов.СоздатьМенеджерЗаписи();
		ЗаписьВОчереди.Документ = ВыборкаДетальныеЗаписи.Резерв;
		ЗаписьВОчереди.Прочитать();
		Если ЗаписьВОчереди.Выбран() Тогда
			ЗаписьВОчереди.Статус = Статус;
			ЗаписьВОчереди.Записать(Истина);
		КонецЕсли;
		СтруктураСостояние = Новый  Структура("Состояние,ДатаПоследнегоИзменения,АвторИзменения,ТорговаяПлощадка"
		,Статус,ТекущаяДатаСеанса(),Пользователи.ТекущийПользователь().ФизическоеЛицо,ВыборкаДетальныеЗаписи.ТорговаяПлощадка);
		РегистрыСведений.ТК_СостояниеДокументов.УстановитьСостояниеДокумента(ВыборкаДетальныеЗаписи.Резерв,СтруктураСостояние);
 	КонецЕсли; 
	
	
КонецПроцедуры 

#КонецОбласти




#Иначе

ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#КонецЕсли
